thesis1/thesisdraft5article.tex
% Created 2010-07-05 Mon 12:48
\documentclass{article}


\title{Draft of diameter paper}
%\author{Don Blair}
\date{05 July 2010}

\begin{document}



\setcounter{tocdepth}{5}
\tableofcontents
%\settocdepth{subparagraph}

\section{Melting A}
\label{sec-1}
\subsection{Background re: melting}
\label{sec-1.1}
\subsubsection{Theories of melting, 3D, 2D, bulk}
\label{sec-1.1.1}
\paragraph{3D crystallites w/ stable surfaces melt from within via Born melting}
\label{sec-1.1.1.1}

     \texttt{CLOSED:} \textit{2010-07-04 Sun 15:28}\newline
In this case, melting can be viewed as nucleation and growth of fluid phase within the solid.
\subparagraph{or yet another structure.}
\label{sec-1.1.1.1.1}
\begin{itemize}

\item or even another\\
\label{sec-1.1.1.1.1.1}%
\end{itemize} % ends low level
\paragraph{2D large crystallites melt by two-step process via hexatic phase}
\label{sec-1.1.1.2}
\paragraph{2D finite crystallites melt from perimeter}
\label{sec-1.1.1.3}
\subparagraph{if melt from perimeter, dN/dt goes as $N^{1/2}$}
\label{sec-1.1.1.3.1}
\subsubsection{Expectations for 2D finite crystallites}
\label{sec-1.1.2}
\subsection{Experiment of Savage et. al}
\label{sec-1.2}
\subsubsection{Setup}
\label{sec-1.2.1}
\subsubsection{Tuneable Depletion potential}
\label{sec-1.2.2}
\subsubsection{Results}
\label{sec-1.2.3}
\paragraph{N vs. t}
\label{sec-1.2.3.1}
\paragraph{$< psi6 >^2$ vs. N}
\label{sec-1.2.3.2}
\paragraph{$C_6$ vs. N, by layer}
\label{sec-1.2.3.3}
\paragraph{No dependence of fast-melting feature on initial cluster size or melting rate}
\label{sec-1.2.3.4}
\subsection{Simulations}
\label{sec-1.3}
\subsubsection{Motivation}
\label{sec-1.3.1}
\subsubsection{GROMACS System}
\label{sec-1.3.2}
\subsubsection{Brownian dynamics}
\label{sec-1.3.3}
\subsubsection{Simulated Depletion Potential}
\label{sec-1.3.4}
\subsubsection{Simulated Lennard-Jones Potential}
\label{sec-1.3.5}
\subsubsection{Results}
\label{sec-1.3.6}
\paragraph{N vs. t}
\label{sec-1.3.6.1}
\paragraph{$< psi6 >^2$ vs. N}
\label{sec-1.3.6.2}
\paragraph{$C_6$ vs. N, by layer}
\label{sec-1.3.6.3}
\paragraph{mean-square fluctuations in bond lengths}
\label{sec-1.3.6.4}
\paragraph{N vs. t for Lennard-Jones potential}
\label{sec-1.3.6.5}
\paragraph{Phase diagram showing lack of fluid phase with short-range potential}
\label{sec-1.3.6.6}
\subsubsection{Discussion}
\label{sec-1.3.7}
\section{Melting B}
\label{sec-2}
\subsection{Background}
\label{sec-2.1}
\subsubsection{Colloids: macroscopic system analogous to atomic system}
\label{sec-2.1.1}
\paragraph{similarites:}
\label{sec-2.1.1.1}
\subparagraph{some phase behavior and phase transitions}
\label{sec-2.1.1.1.1}
\subparagraph{can investiage atomic behavior via analogy}
\label{sec-2.1.1.1.2}
\paragraph{differences:}
\label{sec-2.1.1.2}
\subparagraph{novel phases and phase behavior}
\label{sec-2.1.1.2.1}
\subparagraph{superheated metastable states}
\label{sec-2.1.1.2.2}
\subparagraph{interparticle potential readily modified}
\label{sec-2.1.1.2.3}
\begin{itemize}

\item short-range repulsion, long-range repulsion, short-range repulsion and long-range attraction\\
\label{sec-2.1.1.2.3.1}%
\end{itemize} % ends low level
\subsubsection{Experiment by Savage et. al: novel melting kinetics}
\label{sec-2.1.2}
\paragraph{system: hard spheres with short-range attraction (relative to diameter)}
\label{sec-2.1.2.1}
\paragraph{experiment details}
\label{sec-2.1.2.2}
\paragraph{two-stage melting process}
\label{sec-2.1.2.3}
\subparagraph{first melts from perimeter until reaches critical size}
\label{sec-2.1.2.3.1}
\subparagraph{then breaks up into dense amorphous phase, which is unstable and rapidly evaporates}
\label{sec-2.1.2.3.2}
\subparagraph{crossover occurs at typical 'magic size'}
\label{sec-2.1.2.3.3}
\subparagraph{experiments: magic size \~{} 20-30 particles}
\label{sec-2.1.2.3.4}
\subparagraph{simulations: magic size \~{} 40-50 particles}
\label{sec-2.1.2.3.5}
\subparagraph{little dependence on temperature in experiment}
\label{sec-2.1.2.3.6}
\subparagraph{(?) no dependence on temp in simulation?}
\label{sec-2.1.2.3.7}
\paragraph{possible explanations ruled out:}
\label{sec-2.1.2.4}
\subparagraph{'fast melting' behavior means rate not limited by thermal breaking of bonds}
\label{sec-2.1.2.4.1}
\begin{itemize}

\item (since this would go as $N^(1/2)$\\
\label{sec-2.1.2.4.1.1}%
\end{itemize} % ends low level
\subparagraph{density decreases as crystallites shrink: melting kinetics not governed by surface tension}
\label{sec-2.1.2.4.2}
\begin{itemize}

\item (?) does this contradict lacoste's argument?\\
\label{sec-2.1.2.4.2.1}%
\item (?) can i get data re: surface tension from tony, from simulations?\\
\label{sec-2.1.2.4.2.2}%
\end{itemize} % ends low level
\subparagraph{melting behavior not history dependent}
\label{sec-2.1.2.4.3}
\begin{itemize}

\item no dependence on initial cluster size, melting rate in experiment\\
\label{sec-2.1.2.4.3.1}%
\item (?) no dependence in simulation ?\\
\label{sec-2.1.2.4.3.2}%
\end{itemize} % ends low level
\paragraph{not classical nucleation of liquid within solid below critical crystal size}
\label{sec-2.1.2.5}
\subparagraph{energetically unfavorable given positive surface energy}
\label{sec-2.1.2.5.1}
\subparagraph{positive difference between chemical potentials of two phases}
\label{sec-2.1.2.5.2}
\subparagraph{(?) understand this argument, relevant equations}
\label{sec-2.1.2.5.3}
\subsubsection{Our hypothesis:  thermally-activated defects enhance melting rate}
\label{sec-2.1.3}
\paragraph{thermal introduction of disclinations favorable after critical size}
\label{sec-2.1.3.1}
\paragraph{presence of disclinations leads to concentration of stress}
\label{sec-2.1.3.2}
\paragraph{stress can be released through propagation of cracks}
\label{sec-2.1.3.3}
\paragraph{cracks propagate or not depending on range of potential}
\label{sec-2.1.3.4}
\paragraph{short-range, 'brittle' potential allow cracks to propagate}
\label{sec-2.1.3.5}
\paragraph{longer-range, 'ductile' potential doesn't}
\label{sec-2.1.3.6}
\paragraph{(?) is notion of a 'crack' in a liquid droplet sensible?}
\label{sec-2.1.3.7}
\subsubsection{Simulations yield same result re:}
\label{sec-2.1.4}
\subsubsection{Hypothesis: thermally-activated defects enhance melting rate in short-range, 2D system}
\label{sec-2.1.5}
\subsubsection{Evidence:}
\label{sec-2.1.6}
\paragraph{Disclinations are implicated in breakup}
\label{sec-2.1.6.1}
\subparagraph{GROMACS BD simulations, using depletion-like potential (from Part A)}
\label{sec-2.1.6.1.1}
\subparagraph{exhibit fast-melting (from Part A)}
\label{sec-2.1.6.1.2}
\subparagraph{order parameter decreases sharply (Part A)}
\label{sec-2.1.6.1.3}
\subparagraph{ave disclination 'charge' reaches +1 at the magic size}
\label{sec-2.1.6.1.4}
\paragraph{Disclinations and two-stage melting affected by range of potential}
\label{sec-2.1.6.2}
\subparagraph{Own BD simulations with screened Coulomb potential}
\label{sec-2.1.6.2.1}
\subparagraph{Tune range of potential, short- and long-range (lambda values?)}
\label{sec-2.1.6.2.2}
\subparagraph{Short-range: x percent fast melting; long-range: y percent fast melting; x>>y}
\label{sec-2.1.6.2.3}
\subsection{Simulation Methods}
\label{sec-2.2}
\subsubsection{Gromacs system}
\label{sec-2.2.1}

Here's a good test. \cite{Deng2009}
\subsubsection{Brownian Dynamics}
\label{sec-2.2.2}
\subsubsection{Characteristics of Simulated Depletion Potential}
\label{sec-2.2.3}
\subsubsection{Initial configurations}
\label{sec-2.2.4}
\subsection{Results}
\label{sec-2.3}
\subsubsection{N vs t}
\label{sec-2.3.1}
\subsubsection{Order vs. N}
\label{sec-2.3.2}
\subsubsection{Breakdown by layers}
\label{sec-2.3.3}
\subsection{Conclusions}
\label{sec-2.4}
\section{Diameter of Random Clusters}
\label{sec-3}
\subsection{Background}
\label{sec-3.1}
\subsection{Simulations}
\label{sec-3.2}
\subsection{Results}
\label{sec-3.3}
\section{Phase Transitions in Computational Complexity}
\label{sec-4}
\subsection{Background}
\label{sec-4.1}
\subsubsection{Constraint Satisfaction Problems (CSP)}
\label{sec-4.1.1}
\paragraph{Examples}
\label{sec-4.1.1.1}
\subparagraph{kSAT}
\label{sec-4.1.1.1.1}
\subparagraph{Graph-coloring}
\label{sec-4.1.1.1.2}
\subparagraph{Spin models}
\label{sec-4.1.1.1.3}
\subparagraph{error-correcting codes}
\label{sec-4.1.1.1.4}
\paragraph{Observation of threshold behavior in CSP}
\label{sec-4.1.1.2}
\paragraph{Difficulties in tackling phase behavior of CSP}
\label{sec-4.1.1.3}
\subsubsection{Proposal: study complexity of percolation model}
\label{sec-4.1.2}
\subsection{Percolation}
\label{sec-4.2}
\subsubsection{The Model}
\label{sec-4.2.1}
\subsubsection{Background / applications}
\label{sec-4.2.2}
\subsection{PRAM}
\label{sec-4.3}
\subsubsection{Applications in comp sci}
\label{sec-4.3.1}
\subsubsection{PRIORITY CRCW}
\label{sec-4.3.2}
\subsection{Parallel Algorithm for Percolation}
\label{sec-4.4}
\subsection{Results}
\label{sec-4.5}
\subsubsection{D$_2$ vs. p for several system sizes L}
\label{sec-4.5.1}
\subsubsection{log(D$_2$) vs. log(L)}
\label{sec-4.5.2}
\subsubsection{Distribution of cluster sizes}
\label{sec-4.5.3}
\paragraph{logarithmic or power law? (power law --> algorithm will often fail)}
\label{sec-4.5.3.1}



\bibliographystyle{plain}
\bibliography{/home/dwblair/Dropbox/dwbdocs/physics/writing/bibfiles/combo}

 
    

    

\end{document}